#Завдання 1
n1 = int(input("Введіть перше число:" ))
n2 = int(input("Введіть друге число:" ))
n3 = int(input("Введіть третє число:" ))
d = input("Введіть дію, яку потрібно виконати, * або + :")

if d == "+":
    r = n1 + n2 + n3
    print(r)
elif d == "*":
    r = n1 * n2 * n3
    print(r)
else:
    print("Значення введено не вірно")
#Завдання 2
n1 = int(input("Введіть перше число:" ))
n2 = int(input("Введіть друге число:" ))
n3 = int(input("Введіть третє число:" ))
d = input("Введіть дію, яку потрібно виконати: max - максимум з трьох чисел, min- мінімум з трьох чисел, avrg - середньоарифметичне:")

if d == "max":
    if n1>n2>n3:
        print(f"Максимум з трьох {n1}")
    elif n2>n1>n3:
        print(f"Максимум з трьох {n2}")
    else:
        print(f"Максимум з трьох {n3}")

elif d == "min":
    if n1<n2<n3:
        print(f"Мінімум з трьох {n1}")
    elif n2<n1<n3:
        print(f"Мінімум з трьох {n2}")
    else:
        print(f"Мінімум з трьох {n3}")

elif d == "avrg":
    a = (n1 + n2 + n3) / 3
    print(f"Середньоарифметичне: {a}")
else:
    print("Значення введено не вірно")

#Завдання 3
m = int(input("Введіть кількість метрів:" ))
d = input("Введіть номер величини в яку перевести метри: \n1 - милі \n2 - дюйми \n3 - ярди\n ")

if d == "1":
    r = m*0.00062
    print(f"{m} метрів = {r} миль")
elif d == "2":
    r = m*39.37
    print(f"{m} метрів = {r} дюймів")
elif d == "3":
    r = m*1.09
    print(f"{m} метрів = {r} ярдів")
else:
    print("Значення введено не вірно")